week21_d2_homework_products_and_reviews/products_reviews_app_api/app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]
---
  def index
    reviews = Review.where(product_id: params[:product_id])

INSERT INTO "reviews" ("title", "content", "author", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Hey! Say! JUMP"], ["content", "Hey Say! Best"], ["author", "Hey Say! 7"], ["created_at", "2020-05-11 05:09:30.050679"], ["updated_at", "2020-05-11 05:09:30.050679"], ["product_id", 1]]
---
  def create
    @review = Review.new(review_params)

    if @review.save